# load data from CSVs

In [20]:
import pandas as pd
from sqlalchemy import create_engine

# READING & CLEANING donnees_elec_adresse

In [22]:
# electricity data 2018/2019
addresse_2018 = './data/elec/donnees_elec_adresse_2018.csv'
addresse_2019 = './data/elec/donnees_elec_adresse_2019.csv'

In [23]:
#reading CSV
addresse_2018 = pd.read_csv(addresse_2018, sep=';')
addresse_2018.head(2)
addresse_2018.columns

Index(['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS', 'ADRESSE', 'NOM_COMMUNE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL'],
      dtype='object')

In [24]:
#reading CSV
addresse_2019 = pd.read_csv(addresse_2019, sep=';')
addresse_2019.head(2)
addresse_2019. columns

Index(['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS', 'NOM_COMMUNE', 'ADRESSE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL'],
      dtype='object')

In [25]:
#setting columns in order 

addresse_2019  = addresse_2019[['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS','ADRESSE', 'NOM_COMMUNE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL']]
#Double check 
addresse_2019.columns

Index(['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS', 'ADRESSE', 'NOM_COMMUNE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL'],
      dtype='object')

In [26]:
#concatenate with pd
elec_adresse = [addresse_2018, addresse_2019]
result_elec = pd.concat(elec_adresse).drop_duplicates()
result_elec.head(2)

,OPERATEUR,ANNEE,FILIERE,CODE_IRIS,ADRESSE,NOM_COMMUNE,CODE_GRAND_SECTEUR,CONSO,PDL
0,Enedis,2018,E,010040101,659 AVENUE LEON BLUM,AMBÉRIEU-EN-BUGEY,I,"852,40377",1
1,Enedis,2018,E,010040101,645 AVENUE LEON BLUM,AMBÉRIEU-EN-BUGEY,I,"61,78001",1

In [27]:
result_elec2 = result_elec[['NOM_COMMUNE','CODE_IRIS']].drop_duplicates()
result_elec2.head(2)

          NOM_COMMUNE  CODE_IRIS
0   AMBÉRIEU-EN-BUGEY  010040101
28  AMBÉRIEU-EN-BUGEY  010040102

In [28]:
result_elec.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1132768 entries, 0 to 573808
Data columns (total 9 columns):
 #   Column              Non-Null Count    Dtype
---  ------              --------------    -----
 0   OPERATEUR           1132768 non-null  object
 1   ANNEE               1132768 non-null  int64
 2   FILIERE             1132768 non-null  object
 3   CODE_IRIS           1132768 non-null  object
 4   ADRESSE             1132524 non-null  object
 5   NOM_COMMUNE         1132767 non-null  object
 6   CODE_GRAND_SECTEUR  1132768 non-null  object
 7   CONSO               1132768 non-null  object
 8   PDL                 1132768 non-null  int64
dtypes: int64(2), object(7)
memory usage: 86.4+ MB

# READING & CLEANING donnees_elec_epci

In [16]:
#data
epci_2018 = './data/elec/donnees_elec_epci_2018.csv'
epci_2019 = './data/elec/donnees_elec_epci_2019.csv'

In [17]:
#reading CSV
epci_2018 = pd.read_csv(epci_2018, sep=';')
epci_2018.head(2)
#epci_2018.columns

,OPERATEUR,ANNEE,FILIERE,CODE_EPCI,CODE_CATEGORIE_CONSOMMATION,CODE_SECTEUR_NAF2,CODE_GRAND_SECTEUR,CONSO,PDL,INDQUAL,NB_IRIS_MASQUES,THERMOR,PART
0,Enedis,2018,E,200000172,PRO,NaN,A,"589,3950792135486",34,NaN,2,NaN,NaN
1,Enedis,2018,E,200000172,ENT,1.0,A,"52,78783333333333",1,"0,99999",0,NaN,NaN

In [18]:
#reading CSV
epci_2019 = pd.read_csv(epci_2019, sep=';')
epci_2019.head(2)
#epci_2019.columns

,OPERATEUR,ANNEE,FILIERE,CODE_EPCI,CODE_CATEGORIE_CONSOMMATION,CODE_SECTEUR_NAF2,CODE_GRAND_SECTEUR,CONSO,PDL,INDQUAL,THERMOR,PART,NB_IRIS_MASQUES
0,Enedis,2019,E,200000172,PRO,NaN,A,"658,797605679746",34,NaN,NaN,NaN,2
1,Enedis,2019,E,200000172,ENT,1.0,A,"63,852",1,"0,99999",NaN,NaN,0

In [29]:
#setting columns in order 

#epci_2019  = epci_2019[['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_EPCI',
       'CODE_CATEGORIE_CONSOMMATION', 'CODE_SECTEUR_NAF2',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL', 'INDQUAL', 'NB_IRIS_MASQUES','THERMOR', 'PART'
       ]]
#Double check
#epci_2019.columns

IndentationError: unexpected indent (<ipython-input-29-4057af4c0c09>, line 4)

In [ ]:
#concatenate with pd
#elec_epci = [epci_2018, epci_2019]
#result2 = pd.concat(elec_epci)
#result2.head()

In [ ]:
#result2.info()

# READING & CLEANING donnees_elec_iris

In [30]:
#data
iris_2018 = './data/elec/donnees_elec_iris_2018.csv'
iris_2019 = './data/elec/donnees_elec_iris_2019.csv'

In [31]:
#reading CSV
iris_2018 = pd.read_csv(iris_2018, sep=';')
iris_2018.head(2)
#iris_2018.columns

,OPERATEUR,ANNEE,FILIERE,CODE_IRIS,CODE_CATEGORIE_CONSOMMATION,CODE_SECTEUR_NAF2,CODE_GRAND_SECTEUR,CONSO,PDL,INDQUAL,THERMOR,PART
0,Enedis,2018,E,010010000,PRO,NaN,A,"271,25121416552786",9,"0,45104",NaN,NaN
1,Enedis,2018,E,010010000,PRO,NaN,I,s,s,NaN,NaN,NaN

In [32]:
#reading CSV
iris_2019 = pd.read_csv(iris_2019, sep=';')
iris_2019.head(2)
#iris_2019.columns

,OPERATEUR,ANNEE,FILIERE,CODE_IRIS,CODE_CATEGORIE_CONSOMMATION,CODE_SECTEUR_NAF2,CODE_GRAND_SECTEUR,CONSO,PDL,INDQUAL,THERMOR,PART
0,Enedis,2019,E,010010000,PRO,NaN,A,"315,027040221011",10,"0,52693",NaN,NaN
1,Enedis,2019,E,010010000,PRO,NaN,I,s,s,NaN,NaN,NaN

In [33]:
#setting columns in order

In [34]:
#concatenate with pd
elec_iris = [iris_2018,iris_2019 ]
result3 = pd.concat(elec_iris)
result3.head()

,OPERATEUR,ANNEE,FILIERE,CODE_IRIS,CODE_CATEGORIE_CONSOMMATION,CODE_SECTEUR_NAF2,CODE_GRAND_SECTEUR,CONSO,PDL,INDQUAL,THERMOR,PART
0,Enedis,2018,E,010010000,PRO,NaN,A,"271,25121416552786",9,"0,45104",NaN,NaN
1,Enedis,2018,E,010010000,PRO,NaN,I,s,s,NaN,NaN,NaN
2,Enedis,2018,E,010010000,ENT,10.0,I,"46,63828065665188",1,"0,91765",NaN,NaN
3,Enedis,2018,E,010010000,RES,NaN,R,"2474,6881391654245",346,"0,4933",NaN,NaN
4,Enedis,2018,E,010010000,PRO,NaN,T,"186,81175014015294",17,"0,54212",NaN,NaN

In [ ]:
#result3.info()

# READING & CLEANING donnees_elec_region

In [35]:
#data
region_2018 = './data/elec/donnees_elec_region_2018.csv'
region_2019 = './data/elec/donnees_elec_region_2019.csv'

In [36]:
#reading CSV
region_2018 = pd.read_csv(region_2018, sep=';')
region_2018.head(2)
#region_2018.columns

,OPERATEUR,ANNEE,FILIERE,CODE_REGION,CODE_CATEGORIE_CONSOMMATION,CODE_SECTEUR_NAF2,CODE_GRAND_SECTEUR,CONSO,PDL,INDQUAL,NB_IRIS_MASQUES,THERMOR,PART
0,EdF-SEI,2018,E,01,ENT_PRO,NaN,A,"7441,048",524,NaN,78,NaN,NaN
1,EdF-SEI,2018,E,01,ENT_PRO,NaN,I,"114629,916",2749,NaN,0,NaN,NaN

In [37]:
#reading CSV
region_2019 = pd.read_csv(region_2019, sep=';')
region_2019.head(2)
#region_2019.columns

,OPERATEUR,ANNEE,FILIERE,CODE_REGION,CODE_CATEGORIE_CONSOMMATION,CODE_SECTEUR_NAF2,CODE_GRAND_SECTEUR,CONSO,PDL,INDQUAL,THERMOR,PART,NB_IRIS_MASQUES
0,EdF-SEI,2019,E,01,PRO,NaN,A,"1057,725",61,NaN,NaN,NaN,33
1,EdF-SEI,2019,E,01,ENT,1.0,A,"2550,936",18,NaN,NaN,NaN,0

In [38]:
#setting columns in order 

region_2019  = region_2019[['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_REGION',
       'CODE_CATEGORIE_CONSOMMATION', 'CODE_SECTEUR_NAF2',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL', 'INDQUAL', 'NB_IRIS_MASQUES','THERMOR', 'PART']]
#Double check
#region_2019.columns

In [39]:
#concatenate with pd
elec_region = [region_2018,region_2019 ]
result4 = pd.concat(elec_region)
result4.head()

,OPERATEUR,ANNEE,FILIERE,CODE_REGION,CODE_CATEGORIE_CONSOMMATION,CODE_SECTEUR_NAF2,CODE_GRAND_SECTEUR,CONSO,PDL,INDQUAL,NB_IRIS_MASQUES,THERMOR,PART
0,EdF-SEI,2018,E,01,ENT_PRO,NaN,A,"7441,048",524,NaN,78,NaN,NaN
1,EdF-SEI,2018,E,01,ENT_PRO,NaN,I,"114629,916",2749,NaN,0,NaN,NaN
2,EdF-SEI,2018,E,01,RES,NaN,R,"688474,26",197048,NaN,0,NaN,NaN
3,EdF-SEI,2018,E,01,ENT_PRO,NaN,T,"579488,071",19846,NaN,0,NaN,NaN
4,EdF-SEI,2018,E,01,ENT_PRO,NaN,X,"75139,044",5919,NaN,0,NaN,NaN

In [ ]:
#result4.info()

# #cleaning

In [ ]:
#import pandas as pd
#from sqlalchemy import create_engine


#elec_2008 = './data/2017/donnees_elec_2008.csv'
#elec_2009 = './data/2017/donnees_elec_2009.csv'
#elec_2010 = './data/2017/donnees_elec_2010.csv'
#elec_2011 = './data/2017/donnees_elec_2011.csv'
#elec_2012 = './data/2017/donnees_elec_2012.csv'
#elec_2013 = './data/2017/donnees_elec_2013.csv'
#elec_2014 = './data/2017/donnees_elec_2014.csv'
#elec_2015 = './data/2017/donnees_elec_2015.csv'
#elec_2016 = './data/2017/donnees_elec_2016.csv'
elec_2017 = './data/2017/donnees_elec_2017.csv'

In [ ]:
#reading CSV
#elec_2008 = pd.read_csv(elec_2008, sep=';',encoding='latin-1')
#elec_2008.head(2)
#elec_2008.columns

In [ ]:
#reading CSV
#elec_2009 = pd.read_csv(elec_2009, sep=';',encoding='latin-1')
#elec_2009.head(2)
#elec_2009.columns

In [ ]:
#reading CSV
#elec_2010 = pd.read_csv(elec_2010, sep=';',encoding='latin-1')
#elec_2010.head(2)
#elec_2010.columns

In [ ]:
#reading CSV
#elec_2011 = pd.read_csv(elec_2011, sep=';',encoding='latin-1')
#elec_2011.head(2)
#elec_2011.columns

In [ ]:
#reading CSV
#elec_2012 = pd.read_csv(elec_2012, sep=';',encoding='latin-1')
#elec_2012.head(2)
#elec_2012.columns

In [ ]:
#reading CSV
#elec_2013 = pd.read_csv(elec_2013, sep=';',encoding='latin-1')
#elec_2013.head(2)
#elec_2013.columns

In [ ]:
#reading CSV
#elec_2014 = pd.read_csv(elec_2014, sep=';',encoding='latin-1')
#elec_2014.head(2)
#elec_2014.columns

In [ ]:
#reading CSV
#elec_2015 = pd.read_csv(elec_2015, sep=';',encoding='latin-1')
#elec_2015.head(2)
#elec_2015.columns

In [ ]:
#reading CSV
#elec_2016 = pd.read_csv(elec_2016, sep=';',encoding='latin-1')
#elec_2016.head(2)
#elec_2016.columns

In [ ]:
#reading CSV
#elec_2017 = pd.read_csv(elec_2017, sep=';',encoding='latin-1')
#elec_2017.head(2)
#elec_2017.columns

In [ ]:
#elec_prior_2017= [elec_2008,elec_2009,elec_2010,elec_2011,elec_2012,elec_2013,elec_2014,elec_2015,elec_2016,elec_2017]
#result5 = pd.concat(elec_prior_2017)
#result5.head()

In [40]:
import pandas as pd
from sqlalchemy import create_engine

# gas data 2018/2019
gas_2018 = './data/gaz/donnees_gaz_adresse_2018.csv'
gas_2019 = './data/gaz/donnees_gaz_adresse_2018.csv'

In [41]:
#reading CSV
gas_2018 = pd.read_csv(gas_2018, sep=';')
gas_2018.head(2)
gas_2018.columns

Index(['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS', 'ADRESSE', 'NOM_COMMUNE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL'],
      dtype='object')

In [42]:
#reading CSV
gas_2019 = pd.read_csv(gas_2019, sep=';')
gas_2019.head(2)
gas_2019.columns

Index(['OPERATEUR', 'ANNEE', 'FILIERE', 'CODE_IRIS', 'ADRESSE', 'NOM_COMMUNE',
       'CODE_GRAND_SECTEUR', 'CONSO', 'PDL'],
      dtype='object')

In [43]:
#concatenate with pd
gas_adresse = [gas_2018, gas_2019]
result_gas = pd.concat(gas_adresse)
result_gas.head()

,OPERATEUR,ANNEE,FILIERE,CODE_IRIS,ADRESSE,NOM_COMMUNE,CODE_GRAND_SECTEUR,CONSO,PDL
0,GRDF,2018,G,010040101,58 AVENUE PAUL PAINLEVE,AMBÉRIEU-EN-BUGEY,T,"4,641144e+02",1
1,GRDF,2018,G,010040101,54 AVENUE PAUL PAINLEVE,AMBÉRIEU-EN-BUGEY,R,"1,595118e+02",11
2,GRDF,2018,G,010040101,RTE CHATEAU GAILLARD,AMBÉRIEU-EN-BUGEY,T,"5,609286e+02",1
3,GRDF,2018,G,010040101,36 ALLEE DE LA BARBOTIERE,AMBÉRIEU-EN-BUGEY,T,"1,236034e+03",1
4,GRDF,2018,G,010040101,RUE MARIUS BERLIET,AMBÉRIEU-EN-BUGEY,T,"9,765200e+01",1

In [44]:
result_gas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 477652 entries, 0 to 238825
Data columns (total 9 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   OPERATEUR           477652 non-null  object
 1   ANNEE               477652 non-null  int64
 2   FILIERE             477652 non-null  object
 3   CODE_IRIS           477652 non-null  object
 4   ADRESSE             477182 non-null  object
 5   NOM_COMMUNE         477652 non-null  object
 6   CODE_GRAND_SECTEUR  477652 non-null  object
 7   CONSO               477652 non-null  object
 8   PDL                 477652 non-null  int64
dtypes: int64(2), object(7)
memory usage: 36.4+ MB

In [45]:
result_elec.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1132768 entries, 0 to 573808
Data columns (total 9 columns):
 #   Column              Non-Null Count    Dtype
---  ------              --------------    -----
 0   OPERATEUR           1132768 non-null  object
 1   ANNEE               1132768 non-null  int64
 2   FILIERE             1132768 non-null  object
 3   CODE_IRIS           1132768 non-null  object
 4   ADRESSE             1132524 non-null  object
 5   NOM_COMMUNE         1132767 non-null  object
 6   CODE_GRAND_SECTEUR  1132768 non-null  object
 7   CONSO               1132768 non-null  object
 8   PDL                 1132768 non-null  int64
dtypes: int64(2), object(7)
memory usage: 86.4+ MB

In [46]:
gas_elec = [result_gas, result_elec]
gas_elec = pd.concat(gas_elec)
gas_elec.head()

,OPERATEUR,ANNEE,FILIERE,CODE_IRIS,ADRESSE,NOM_COMMUNE,CODE_GRAND_SECTEUR,CONSO,PDL
0,GRDF,2018,G,010040101,58 AVENUE PAUL PAINLEVE,AMBÉRIEU-EN-BUGEY,T,"4,641144e+02",1
1,GRDF,2018,G,010040101,54 AVENUE PAUL PAINLEVE,AMBÉRIEU-EN-BUGEY,R,"1,595118e+02",11
2,GRDF,2018,G,010040101,RTE CHATEAU GAILLARD,AMBÉRIEU-EN-BUGEY,T,"5,609286e+02",1
3,GRDF,2018,G,010040101,36 ALLEE DE LA BARBOTIERE,AMBÉRIEU-EN-BUGEY,T,"1,236034e+03",1
4,GRDF,2018,G,010040101,RUE MARIUS BERLIET,AMBÉRIEU-EN-BUGEY,T,"9,765200e+01",1

In [47]:
gas_elec.shape

(1610420, 9)

In [1]:
import psycopg2
from psycopg2 import OperationalError as e
import pandas as pd
from sqlalchemy import create_engine
import datetime

In [2]:
def connection_db(db, user, password, host, port):
    try:
        connection = psycopg2.connect(
        database = db,
        user = user,
        host = host,
        password = password,
        port = port)
        print(f'successfully connected to {db}')
    except e: 
        print(f'could not connect to the database {db} provided')
    return connection #sinon ça ne fonctionne pas

In [3]:
#conn = connection_db('final_project','sandrinevuachet','postgres','localhost',5432)
#cursor = conn.cursor()
#conn.autocommit = True

In [4]:
def connection():
    db = 'postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project'
    engine = create_engine(db,client_encoding='utf8')
    print(f'successfully connected to {db}')
    return engine
engine = connection()

successfully connected to postgres+psycopg2://sandrinevuachet:postgres@localhost:5432/final_project

In [5]:
with engine.connect() as connection:
    result = connection.execute("select * from operators")
    for row in result:
        print(row)
        #print("username:", row['username'])

(1, 'Enedis')
(2, 'RTE')
(3, 'GRDF')
(4, 'GRT_GAZ')
(5, 'Teréga')

In [13]:
sql_table = pd.read_sql_table('all_data',engine)
sql_table.head(3)

,id,operators,year,energy,code_iris,address,city,code,consu,pdl
0,1,Enedis,2018,E,010040101,659 AVENUE LEON BLUM,AMBÉRIEU-EN-BUGEY,I,"852,40377",1
1,2,Enedis,2018,E,010040101,645 AVENUE LEON BLUM,AMBÉRIEU-EN-BUGEY,I,"61,78001",1
2,3,Enedis,2018,E,010040101,268 RUE DES MOUETTES,AMBÉRIEU-EN-BUGEY,I,"63,2543",1

In [14]:
table = pd.read_sql_table('deliveries',engine)
table.head(3)

,id,year,iris_code,consumption,address,sector_id,operator_id,energy_id,city_id
0,1,2018,010040101,"1,073901e+02",82 RUE DES MOUETTES,2,3,2,1
1,2,2018,010040101,"1,151224e+02",84 RUE DES MOUETTES,2,3,2,1
2,3,2018,010040101,"1,236034e+03",36 ALLEE DE LA BARBOTIERE,3,3,2,1

In [15]:
table1 = pd.read_sql_table('cities',engine)
table1.head(3)

   id               name
0   1  AMBÉRIEU-EN-BUGEY
1   2           AMBRONAY
2   3          ANGLEFORT

In [ ]:
#with engine.connect() as connection:
    #result = connection.execute("""CREATE TABLE IF NOT EXISTS "associations"(
      #"id" SERIAL PRIMARY KEY,
      #"RNA" varchar,
      #"name" varchar,
      #"sigle" varchar,
      #"description" varchar,
      #"validation" varchar,
      #"validation_date" date,
      #"headquarter" varchar,
      #"liste_activites" varchar,
      #"contact_address" varchar,
      #"zip_code" integer,
     #"city" varchar,
      #"website" varchar,
      #"establishment" integer
   # );""")

In [51]:
hot_2018 = './data/hot_cold/donnees_chaleur_froid_reseau_2018.csv'
hot_2019 = './data/hot_cold/donnees_chaleur_froid_reseau_2019.csv'
hot_iris_2018 = './data/hot_cold/donnees_chaleur_et_froid_iris_2018.csv'
hot_iris_2019 = './data/hot_cold/donnees_chaleur_et_froid_iris_2019.csv'

hot_2018 = pd.read_csv(hot_2018, sep=';')
hot_2019 = pd.read_csv(hot_2019, sep=';')
hot_iris_2018 = pd.read_csv(hot_iris_2018, sep=';')
hot_iris_2019 = pd.read_csv(hot_iris_2019, sep=';')

In [56]:
hot_2018.head(3)

,ID,OPERATEUR,ANNEE,FILIERE,CODE,PUISSANCE,PUISSANCE - GAZ NATUREL,PUISSANCE - CHARBON,PUISSANCE - FIOUL DOMESTIQUE,PUISSANCE - FIOUL LOURD,...,PCTCOG - DECHETS INTERNES,PCTCOG - BIOGAZ,PCTCOG - AUTRES,PDL,CONSOTOT,CONSOR,CONSOT,CONSOI,CONSOA,CONSONA
0,0101C,Quartier de La Reyssouze,2018,C,01053,"39,00000","34,000","0,00","0,000","0,00",...,0.0,0.0,0.0,55,31837,25470,6367,0,0,0
1,0102C,Réseau de chaleur d'Hauteville Lompnes,2018,C,01185,"5,40000","0,000","0,00","0,000","0,00",...,0.0,0.0,0.0,20,4721,1188,3533,0,0,0
2,0103C,Oyonnax BioChaleur,2018,C,01283,"38,71000","27,710","0,00","0,000","0,00",...,0.0,0.0,0.0,86,43045,32284,10761,0,0,0

In [57]:
hot_iris_2018.head(3)

,ID,OPERATEUR,ANNEE,FILIERE,CODE,CODE_GRAND_SECTEUR,CONSO,PDL
0,0103C,Oyonnax Biochaleur,2018,C,010310000,X,"8213,99",1
1,0106C,Belena,2018,C,010340102,I,s,s
2,0106C,Belena,2018,C,010340102,R,2452,6

In [58]:
hot_2019.head(3)

,ID,OPERATEUR,ANNEE,FILIERE,CODE,PUISSANCE,PUISSANCE - GAZ NATUREL,PUISSANCE - CHARBON,PUISSANCE - FIOUL DOMESTIQUE,PUISSANCE - FIOUL LOURD,...,PCTCOG - DECHETS INTERNES,PCTCOG - BIOGAZ,PCTCOG - AUTRES,PDL,CONSOTOT,CONSOR,CONSOT,CONSOI,CONSOA,CONSONA
0,0101C,Quartier de La Reyssouze,2019,C,1053.0,"41,3000","36,300","0,00","0,000","0,00",...,"0,000","0,000",0.0,71,30027,24022,6005,0,0,0
1,0103C,Oyonnax BioChaleur,2019,C,1283.0,"38,7100","27,710","0,00","0,000","0,00",...,"0,000","0,000",0.0,91,44385,33289,11096,0,0,0
2,0105C,Réseau de saint-denis-les-bourg,2019,C,1344.0,"1,6500","0,750","0,00","0,000","0,00",...,"0,000","0,000",0.0,13,1389,278,1111,0,0,0

In [59]:
hot_iris_2019.head(3)

,ID,OPERATEUR,ANNEE,CODE,FILIERE,CODE_GRAND_SECTEUR,CONSO,PDL
0,0103C,Oyonnax Biochaleur,2019,010310000,C,X,"5799,37",12
1,0103C,Oyonnax Biochaleur,2019,011810000,C,X,"417,77",1
2,0103C,Oyonnax Biochaleur,2019,012830102,C,X,"11931,26",23